Tekla Open API Reference for Tekla Structures 2025
Model.FetchModelObjects Method (List<String>, Boolean)
 Fetches a list of modelobjects based on given guid list of objects, checks if guid is native or external (for reference model object) and optionally selects objects before returning them.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<ModelObject> FetchModelObjects(
	List<string> Guids,
	bool SelectInstances = true
)
Public Function FetchModelObjects (
	Guids As List(Of String),
	Optional SelectInstances As Boolean = true
) As List(Of ModelObject)
Parameters
Guids
Type: System.Collections.Generic.List<String>
The GUID list to look for in the model.
SelectInstances (Optional)
Type: System.Boolean
Optional parameter whether object is selected, default = true.
Return Value
Type: List<ModelObject>
The model objects with the given guids, or empty list if any of the objects do not exists or object data loading failed for some reason.
Examples
 Guids of selected model objects are stored to list and fetched using guid list:
using System;
using System.Collections.Generic;
using System.Windows.Forms;
using Tekla.Structures.Model;
using TSMU = Tekla.Structures.Model.UI;
public class Example
{
    public void Example1()
    {
        Model model = new Model();
        var selector = new TSMU.ModelObjectSelector();
        var selection = selector.GetSelectedObjects();
        var guidList = new List<string>();
        foreach (ModelObject obj in selection)
        {
            var ro = obj as ReferenceModelObject;
            string guid = string.Empty;
            if (ro != null)
            {
                if(ro.GetReportProperty("EXTERNAL.GUID", ref guid))
                    guidList.Add(guid);
            }
            else
            {
                guidList.Add(obj.Identifier.GUID.ToString());
            }
        }
        var objList = model.FetchModelObjects(guidList, false);
        MessageBox.Show(objList.Count.ToString() + " objects found.");
    }
}
See Also
Reference
Model Class
FetchModelObjects Overload
Tekla.Structures.Model Namespace